TDPortal/Codebase/TransportDirect/JourneyPlannerCaller/bin/Debug/Requests/GazRequest_FetchAddressAlias.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FetchAddressAlias xmlns="http://www.esriuk.com/gazops">
      <recordid>114632</recordid>
      <gazid>ADDP1</gazid>
      <envelope></envelope>
      <securityToken></securityToken>
    </FetchAddressAlias>
  </soap:Body>
</soap:Envelope>